export const dataList = [
  {
    id: 1,
    q: "하고싶은 개발 분야를 선택하세요.",
    a: ["프론트엔드", "백엔드", "안드로이드", "IOS", "AI", "데이터", "Devops"],
  },
  {
    id: 2,
    q: "사용 가능한 기술 스택을 골라주세요.",
    a: {
      프론트엔드: [
        "React",
        "TypeScript",
        "Angular",
        "Vue",
        "Ember",
        "Node",
        "Nuxt",
        "Next",
        "etc",
      ],
      백엔드: ["Flask", "Django", "Spring", "Express", "Koa", "etc"],
      안드로이드: ["Android"],
      IOS: ["Swift", "Object-C", "etc"],
      AI: ["AI"],
      데이터: ["DATA"],
      Devops: ["Devops"],
    },
  },
  {
    id: 3,
    q: "활동 가능 시간을 설정해주세요.",
    a: [
      "평일 9AM~12PM",
      "평일 12PM~6PM",
      "평일 6PM~12AM",
      "주말 9AM~12PM",
      "주말 12PM~6PM",
      "주말 6PM~12AM",
    ],
  },
  {
    id: 4,
    q: "선호하는 진행 방식을 선택해주세요.",
    a: ["오프라인", "온라인"],
  },
  {
    id: 5,
    q: "팀프로젝트 경험이 있으신가요?",
    a: ["경험 있음", "경험 없음"],
  },
  {
    id: 6,
    q: "팀프로젝트에서 중요하게 생각하는 요소를 선택해주세요.",
    a: ["디자인", "기능", `UI UX`, "일정", "실력", "친목"],
  },
  {
    id: 7,
    q: "자기소개를 해주세요.",
  },
  {
    id: 8,
    q: "현재 직업은 무엇인가요?",
  },
  {
    id: 9,
    q: "연락처를 입력해주세요.",
  },
  {
    id: 10,
    q: "포트폴리오 주소를 입력해주세요.",
  },
];
